---
type: FabricationHostedInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# FabricationHostedInfo

`Autodesk.Revit.DB.FabricationHostedInfo` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | DisconnectFromHost | 2016 | `public void DisconnectFromHost ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBearerCenterline | 2017 | `public Line GetBearerCenterline ()` |
| Method | PlaceOnHost | — | `` |
| Property | HostId | 2016 | `public ElementId HostId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |